<template>
  <div class="container-feature">
    <Header/>
    <div class="ft-title">
      『鉄道』-鉄研の車窓から-
    </div>
    <p class="ft-text">
      こんにちは！鉄道研究部です。鉄道研究部では毎年、「鉄研の車窓から」という名前で企画展示を行っています。私達の目的は、展示を通して、（鉄道の面白さ）を伝えることにあります。お伝えする展示を見て、一つでも興味のある企画が見つかったら、ぜひ当日、高校教室3階（A301）でお会いしましょう。お待ちしております。
    </p>

    <div class="ft-subtitle">鉄道研究部</div>
    <p class="ft-text">
    鉄道研究部、通称「鉄研」は、その名に違わず、「鉄道」を研究し、愛好する部活です。他校では「交通研究部」と呼ばれることもあります。入部条件は（鉄道が好きであること）のみ。ですから、部員は様々なジャンルに分かれます。筆者は鉄道模型を専門に扱う、通称（模型鉄）ですが、部員の数だけジャンルがあると言えます。
      <br>その多様性がよく現れるのが春・夏に行われる「合宿」と、初夏・秋に行われる旅行会です。合宿では1日ごと、旅行会（1日）では終日、班に分かれ行動します。班の内容もとても多彩で、列車を撮影する撮り鉄班、様々な路線に乗車する乗り潰し班、特定の観光列車に乗車することを目的とする乗車班など、枚挙に暇がありません。
    </p>
    <div class="ft-subtitle">鉄道は面白い</div>
    <p class="ft-text">
    前項でもお話した通り、鉄道研究部には様々な部員がいて、それぞれが様々な理由で鉄研に入部してきます。前項で模型鉄について少しお話ししましたが、他にも駅の発車メロディを録音・収集する「音鉄」、鉄道写真の撮影がメインの「撮り鉄」、鉄道グッズや切符などを集める「収集鉄」など、実に様々です。実は「旅行が好き」という理由で入部する部員もいます。筆者は模型鉄ですから、「この線路の引き方はあり得ない」「こうするとリアルに見えるのではないか」「この駅構造にはこんな理由がある」など、リアルさを求める議論が鉄道趣味の醍醐味であるように思います(展示されている模型にも詳細設定が存在します)。<br>このように、人によって様々な楽しみ方ができることも鉄道の面白さであるし、鉄研という団体が60年も継続する理由ではないかと私は思います。
    </p>
    <div class="ft-subtitle">キッカケ</div>
    <p class="ft-text">
    しかし、そのような部員も、生まれつき鉄道好きだったというわけではもちろんありません。皆いろいろなきっかけがあります。電車通学を続けていたら自然になったとか、いつも鉄道を眺めていたとか、これらは一例にすぎません。例えば私はデパートの福引でもらった鉄道模型が興味を持つきっかけだったと記憶していますから、出会いというのは多分に運命的であると言えます。

    <div class="ft-subtitle">通常ダイヤ</div>
    <p class="ft-text">
    そんな鉄道研究部の唯一の研究発表の場が開成祭です。我々は開成祭を基準に活動していると言っても過言ではありません。例えば「鉄研の車窓から」の展示室に入るとまず初めに目につくであろう「大レイアウト(ジオラマ)」は制作に6~9ヶ月ほどかかります。来年の開成祭の日程を見ながら作成計画を立てる必要があり、地味ですが神経を使います。平常時の活動はほぼレイアウト作成に充てられていますが、この他にも、開成祭で配布する部誌「乗降場」の記事執筆のための事前調査、合宿のコース作成、OB会に出席してOBと親睦を深める、入学後の部活勧誘会で使う小レイアウトの作成など多岐に渡ります。
    <p class="ft-text">
      このように多様性を尊重し、その専門分野を伸ばしてきたからこそ、様々な部員とともに活気ある鉄研になったのではないでしょうか。また、「音」や「模型」といった一件関係なさそうな趣味をつないで一つのジャンルを形成してしまうのも、「鉄道の面白さ」と言えるかもしれません。
    <p class="ft-text">
      いかがでしたか？「鉄道の面白さ」が少しでも伝わりましたら、以下の展示内容で興味のあるものを探してみてください。

    <div class="ft-subtitle">今年の展示</div>
    <p class="ft-text">
    今回は「見やすい展示」をモットーに、室内配置を見直しました。今年から復活した企画などもありますので、是非隅々までご覧ください。
    </p>
    <div class="ft-subtitle">展示内容</div>
    <p class="ft-text">
      <strong>1.模型の体験運転</strong><br>
      鉄研の車窓からでは、部員が作成したジオラマを用いた、鉄道模型の体験運転を行っています。このジオラマ、7畳分もの大きさを持っていて、普段めったに出会うことの出来ないスケールの中での模型の運転体験をすることができます。また、車両は一定時間ごとに入れ替わるので、様々な車両を運転できる可能性があります。車両は30分おきに変わるので、少し待ってみるとお目当ての車両が走るかも・・・？
      <br><br><strong>2.前面展望の上映</strong><br>
      展示室入口付近で、前面展望（先頭車両から撮影した映像）を上映しています。映像は全て部員が撮影・編集していて、ローカル線から通勤路線まで実にたくさんあります。
      <br><br><strong>3.発車ベル体験</strong><br>
      駅などで乗務員の方が「発車ベルボタン」を押しているのを見たことがある人もいるのではないでしょうか？本企画では、そのボタンを用いた発車ベル体験を行っています。発車メロディの音源はほとんどが部員の手による録音で、押すたびにメロディが切り替わります。家の近くの駅のメロディなどを探してみるのも面白いかもしれませんね。
      <br><br><strong>4.鉄道シミュレータ</strong><br>
      部員が作成した路線データで、車両を走行させることができます。沿線も作り込まれていて、実際に運転しているような気分に浸れます。
      <br><br><strong>5.方向幕・記念品</strong><br>
      出口付近で展示しています。方向幕は東急電鉄とJR常磐線で実際に使用されていたもので、回すことができます。
    </p>

    <div class="ft-subtitle">

    </div>
  </div>
</template>

<script>
    import Header from '~/components/Myheader.vue'
    import Article from '~/components/FeatureArticle.vue'

    export default {
        name: "feature",
        components: {
            Article,
          Header
        },
        data() {
            return {
                message: "Hello"
            }
        }
    }
</script>

<style scoped>
  a:link {
    text-decoration: none;
  }

  .container-feature {
    padding: 0px 15px 30px;
    background-color: #411445;
    color: white;
  }
  .head-thumbnail >img{
    width: 100%;
    object-fit: cover;
  }

  .ft-title {
    font-size: 24px;
    font-weight: bold;
    line-height: 1.2;
    padding: 140px 0px 60px;
  }
  .ft-subtitle{
    font-size: 20px;
    font-weight: bold;
    margin-top: 30px;
  }

  .ft-text{
    padding: 30px 5px;
    line-height: 1.7;
    letter-spacing: 0.05em;
    justify-content: center;
    text-indent: 1;
    initial-letter: 30;

  }
  .ft-text >img {
    width: 80%;
    margin: 10px auto;
    display: flex;

  }
  .ft-thumb{
    font-size: 13px;
    text-align: center;
    margin: 20px auto;
  }

</style>