<template>
  <div class="container-feature">
    <Header/>
    <div class="ft-title">
      数学研究部
    </div>
    <p class="ft-text">
      数学研究部です。数学研究部では毎年セコリス(パズル)や入試予想、GP(数オリ模試)、数研部員と勝負！(対戦ゲーム)、部誌の配布など様々な算数・数学に関する参加型展示を行っています。様々な企画を用意しているので、年齢関係なく楽しめます。算数・数学が好きな人はぜひ当日A405にお越しください。
    </p>

    <div class="ft-subtitle">活動</div>
    <p class="ft-text">  数学研究部の活動は主に2つに大別されます。<br>
      一つ目は、ゼミです。去年は、線形代数や群論、位相空間論などの大学生が勉強する内容を勉強しました。今年は1学期は大人しめに合同式や微分を勉強しました。
      <br>　こういった活動を開いた理由は簡単です。数学は一人じゃ勉強できません。算数ならまだ一人でも大丈夫なことが多かったかもしれませんが、たとえば「線型写像と行列の関係」や「準同型定理」、「コンパクト性」といったことは、分かっている人にとっては息を吐くより簡単なことですが、初めて勉強する人にとっては難しいでしょう。僕は相当悩みました。悩みまくってようやく理解して「なんだこういうことなのか」って気付いたことを共有しています。最近は大学の数学も少しずつ世間に近寄っているらしく、わかりやすいブログやYouTuberなども増えてきました。ですが、依然として難しい数学書は多いです。そういった数学書は「数学を専門的に学ぶ人が一緒に勉強しあう」ために書かれていることが多いので、自分だけで勉強するには向いていないのがほとんどです。しかも誤植はもちろん、本質的なミスがあったり式変形が一気に飛ばされていたりするので、誤解してしまう可能性もあります。そのためにもみんなで勉強できるゼミは重要な活動だと思います。
      <br><br>ちなみにゼミは去年から始まったのですが、これに似た「OB講義」という制度は何年も前からありました。夏に開催される数研合宿に来たOBが何か好きなことを1時間から2時間ほど使って解説するという活動で、今までは、結び目理論や解析力学、代数的整数論、解析的整数論、代数幾何、量子コンピュータなどといった専門的なトピックが扱われてきました。
    </p>

    <p class="ft-text">
      二つ目は、数学オリンピック対策です。算数オリンピックを知っている人も多いと思います。それの延長…と言いたいところですが、数学オリンピックは似て非なるものです。特に異なる点として、算数オリンピックより圧倒的に経験量がものをいうことなどが挙げられます。開成の数学研究部という環境はOBや上級生に国際数学オリンピックの日本代表が多くいることもありとても恵まれています。<br>活動内では講義という形で知識を増やし、皆で協力しながら問題演習をするなどして、この環境を最大限に生かして部員一同切磋琢磨しています。<br>数学オリンピックの分野は4つに大別されていて、それぞれバランスよく出題されるのですが、やはり人それぞれ得意分野・不得意分野が存在します。一人で勉強していると、この分野バランスが偏ってしまいセット運に頼ることになってしまうのですが、やはり部活という形で皆で集まって活動をすることは、お互いに得意分野を伸ばしつつも不得意分野を補うことができるという大きな利点があります。個性を伸ばすための環境がそろっている開成という場所においてはそれが尚更良いものとなります。
  </p>

    <div class="ft-subtitle">最後に</div>
    <p class="ft-text">
      開成には先輩と後輩との脈々と受け継がれる伝統がありますが、数学研究部も多くのことを受け継ぎながら、昇華させつづけています。数学の得手不得手関係なく、好きであるという気持ちさえあれば、広く、そして面白い「数学の世界」に足を踏み入れることができます。<br>文化祭当日、忙しい時間で無ければ質問していただければ可能な範囲で数研についてお話しします。開成に入って数研に入りたい！という方はぜひこの機会にいらしてはいかがでしょうか。
    </p>


  </div>
</template>

<script>
    import Header from '~/components/Myheader.vue'
    import Article from '~/components/FeatureArticle.vue'

    export default {
        name: "feature",
        components: {
            Article,
          Header
        },
        data() {
            return {
                message: "Hello"
            }
        }
    }
</script>

<style scoped>
  a:link {
    text-decoration: none;
  }

  .container-feature {
    padding: 0px 15px 30px;
    background-color: #411445;
    color: white;
  }
  .head-thumbnail >img{
    width: 100%;
    object-fit: cover;
  }

  .ft-title {
    font-size: 24px;
    font-weight: bold;
    line-height: 1.2;
    padding: 140px 0px 60px;
  }
  .ft-subtitle{
    font-size: 20px;
    font-weight: bold;
    margin-top: 30px;
  }

  .ft-text{
    padding: 30px 5px;
    line-height: 1.7;
    letter-spacing: 0.05em;
    justify-content: center;
    text-indent: 1;
    initial-letter: 30;

  }
  .ft-text >img {
    width: 80%;
    margin: 10px auto;
    display: flex;

  }
  .ft-thumb{
    font-size: 13px;
    text-align: center;
    margin: 20px auto;
  }

</style>