<template>
  <div class="container-feature">
    <Header/>
    <div class="ft-title">
    </div>
    <div class="ft-subtitle"></div>
    <p class="ft-text">
      こんにちは、2019年度高校生徒会会長、柴崎珠羽です。148th文化祭では、「開成生と話してみよう」をテーマにした“Let’s talk KAISEI 2019”の参団責任者も務めます。</p>
    <p class="ft-text"> 突然ですが、みなさん、「高校生徒会」や「生徒会長」と聞いて何をイメージするでしょうか？ ――なんか偉そう？すごい人ばっかりいそう？…それとも、なんとなく恐そう？ いえいえ、生徒会長の私はいたって「普通の人」です。必要に応じて、教室の空気にもなれます。おそらく周囲の評価もこれに近いはずです。 今日は、なぜそんな私が生徒会長をしているのかという話を通して、高校生徒会や開成生の日常についても少し触れてみたいと思います。</p>
    <p class="ft-text"> 開成には、学内外で光を放つプロフェッショナルたちが多く存在しており、その活躍ぶりや活動内容の語りは彼ら腕利き達に任せるとして、今回の私は、未来の開成生たちにもこの記事を読んでもらえるような内容にすることにします。無限の可能性をもつ彼らに、未知の「 開　成 」という世界をイメージしてもらえるように。</p>
    <p class="ft-text"> 最初に触れておきますが、高校生徒会本部は、開成を代表するような運動会や文化祭、学年旅行等の行事を仕切っているわけではありません。(これらは、運動会準備委員会、文化祭準備委員会、旅行委員会の各々が担当し、企画・予算・運営等ほぼ生徒の力で行われます。) 生徒会長の実際は、中央執行委員会を中心として活動する生徒会内の役職名の一つにすぎないと私は捉えています。</p>
    <p class="ft-text"> 私は、中３では選挙管理委員長、高１では中執副委員長を務め、種々の生徒会活動に関わってきました。蛇足ですが、中１からずっと運動部の部活動にも打ち込んでいます。これらの経験から見えてきたこととは...</p>
    <p class="ft-text"> 開成生の中には、自分の得意分野を生かしてそれに全力投球できる人が多くいます。彼らの強みは、豊富な知識に高いスキル、またアイデアマンであり行動力もあります。しかし、敢えてここで触れますが、 一人ひとりが独特の強烈な個性の持ち主である分、時としてまとまりにかけ自分にはない他人の個性へ敬意を欠き、結果として素晴らしい発案・計画であるにも関わらず、合意形成が不十分なことにより頓挫してしまうこともあったのです。一人でできることの限界もこれは示しているのでしょう。そして、私の心をざわつかせたのは、この熱い人間ドラマの背景にいる一般の生徒たちの無関心でした。 なんてもったいない！ この思いで、私は今、生徒会長を務めています。</p>
    <p class="ft-text"> 小学生の私は、漠然とした「ペンは剣より強し」の精神に憧憬を抱くものの、頭でっかちでまだ己が見えていませんでした。それが、雑多な、いえ豊かな開成という社会へ飛び込んだことにより、人は己の知識量で勝負するより、多様な個性を認め、社会の一員として生きる力を身に付けることのほうが大切であると学びました。この学びを生かし、私は私の個性（＝ 良くも悪くも普通）を受け入れ、今年度の生徒会は、まだまだ凸凹の個性豊かなプロフェッショナルたちを緩くつなぐ存在にしようと思ったのです。日々の私の仕事は、彼らのチャレンジが、協力者がいないことが原因でボツになることがないよう彼らのために働き、彼らの話（ほぼ愚痴）に耳を傾け、必要な手続きやバックアップをし、生徒会活動に興味がない大多数の生徒にも地道に活動をささやいています。</p>
    <p class="ft-text"> 開成の生徒会活動の特徴は、私たちがやりたいと思ったことを生徒会員の理解を得て自由にチャレンジできることです。特別なことを実行したいと思ったら、そのための期間限定の局だって置くことができるのです。もちろん、発案がユニークすぎて失敗することもありますが。私は、生徒会長として、開成のこういう寛容さが大好きです。</p>
    <p class="ft-text"> 最後に、未来の開成生の皆さん。開成は今、創立150周年記念事業として工事が進められており、生まれ変わろうとしています。埃っぽい思い出の校舎が一つ一つ消えていくのを目の当たりにしてきた私たちは、少し複雑な気もしています。ですが、「開成の精神」はこれからもずっと変わることなく続くと信じています。これからは、皆さんがあなたの耳であなたの肌で開成の風を感じ取り、自分の足で新校舎を歩いてみてください。そこには、きっと素晴らしい大勢の仲間がいて、あなたが一人で答えを出せないかもしれない新しい時代の課題に取り組むとき、何かヒントをくれるはずです。</p>
    <p class="ft-text"> さあ、この話の続きは、文化祭当日、“Let’s talk KAISEI 2019”で。私もそこで待っています。</p>
    <p class="ft-text"> あなたの知りたいことは何ですか？   </p>
    <div class="ft-text">
      1.筐体とは、ゲームを搭載する台のことです。<br>MDF（木の板）や角材をホームセンターで調達し、ノコギリなどで加工する。<br>・シーラー、ラッカーを用いて塗装する。<br>・木ネジで木材同士を固定して組み立てる<br><br>というのが主な作業工程です。
    <img src="../assets/feature-article/image01.jpg">
    <p class="ft-thumb">制作過程1</p>
    <img src="../assets/feature-article/image02.jpg">
    <p class="ft-thumb">制作過程2</p>
    <img src="../assets/feature-article/image03.jpg">
    <p class="ft-thumb">制作過程3</p>
    <img src="../assets/feature-article/image04.jpg">
    <p class="ft-thumb">制作過程4</p>
    </div>

    <div class="ft-text">
      2.ハードウェアは、パネルからの入力をPCに伝え、ソフトウェアで処理された出力を表示します。
      LUXYはディスプレイを直接触って操作するゲームなので、入力と出力は同じ場所で行います。そのため、ディスプレイに外付けのパネルをつけたものを使用しています。（ディスプレイやパネルは通販で購入しました。）また、音響関連のスピーカーやアンプもハードウェアです。
    </div>
    <div class="ft-text">
      3.ソフトウェアは、リズムゲームのシステムやグラフィックを司り、パネルからの入力を処理します。以下はソフトウェアの機能の一部です。
      <br>・4.で作られた譜面を流す。
      <br>・判定ラインにおいて、ノーツを叩いたタイミングが早いか遅いかの判定。
      <br>・スコアの計算。
    <img src="../assets/feature-article/image05.jpg">
    <p class="ft-thumb">プレイ画面</p>
  </div>

    <p class="ft-text">
      4.譜面とは、音楽に合わせて流れてくるノーツの集合体です。ノーツにも、判定ラインに重なる時に叩くもの、弾くもの、長押しするものなど、何種類かあります。
      譜面は自作した専用のソフトを用いて作成しました。
    </p>
    <p class="ft-text">
    文化祭が終わってもアプリ版の実装など、LUXYの活動は終わりませんので、最新情報は<a href="https://twitter.com/KPC_otoge"> Twitter(@KPC_otoge_)</a>でご確認ください。
    </p>

    <div class="ft-subtitle">

    </div>
  </div>
</template>

<script>
    import Header from '~/components/Myheader.vue'
    import Article from '~/components/FeatureArticle.vue'

    export default {
        name: "feature",
        components: {
            Article,
          Header
        },
        data() {
            return {
                message: "Hello"
            }
        }
    }
</script>

<style scoped>
  a:link {
    text-decoration: none;
  }

  .container-feature {
    padding: 0px 15px 30px;
    background-color: #411445;
    color: white;
  }
  .head-thumbnail >img{
    width: 100%;
    object-fit: cover;
  }

  .ft-title {
    font-size: 24px;
    font-weight: bold;
    line-height: 1.2;
    padding: 140px 0px 60px;
  }

  .ft-text{
    padding: 30px 5px;
    line-height: 1.7;
    letter-spacing: 0.05em;
    justify-content: center;
    text-indent: 1;
    initial-letter: 30;

  }
  .ft-text >img {
    width: 80%;
    margin: 10px auto;
    display: flex;

  }
  .ft-thumb{
    font-size: 13px;
    text-align: center;
    margin: 20px auto;
  }

</style>