<template>
  <div class="container-feature">
    <Header/>
    <div class="ft-title">
      日本語に恋して
    </div>
    <p class="ft-text">
      こんにちは！　日本語同好会です！　当日は「にほんごであそぶ男たち 2nd」を運営していますので、ぜひ足を運んでみてくださいね。</p>
    <p class="ft-text">さて、皆さん。日本語、使っていますか？<br>
      私は使っています。皆さんも恐らく使っているんでしょうね。概ね日本語を母語とする人がこれを読んでいるのでしょうが、母語は「無意識に」喋れるものであるので、特に勉強したり調べたりなさらないでしょう。でも、私たちがいちばん親しい日本語だからこそ、詳しいニュアンスや語法に踏み込んで考えられるのです。日本語の世界は奥深く、果てなく続いています。下に去年配布した冊子の文章を一部改変して載せてあります。<br>
      これを読んで、皆さんも日本語「沼」にハマってみませんか？
    <br><br>
      ※「沼』とは新語で、趣味の世界などのうち、深淵で入ったら抜け出せないようなもののことを言います。概ね肯定的に用いられます。
      （例：「カメラ沼にハマる」≒カメラの深い世界にハマって抜け出せなくなる）
    </p>

    <div class="ft-subtitle">「君に恋してる」に関する簡単な考察<br>佐々木柊</div>
    <div class="ft-subtitle">一　導入</div>
    <p class="ft-text">　言葉というものは往々にして人生の大事な場面でどうしても出てくる。プレゼンテーションにせよ、面接にせよ。あるいは、たとえば意中の人に告白するとき、諸君はなんと言うだろうか。<br>
      「君を愛してるよ」<br>
      とでも言うのだろうか。しかし、告白が成功したら「恋人」になる関係の二人であって、「愛人」になるべき二人ではあるまいな。<br>
      「君を恋してるよ」<br>
      ではいけないのだろうか。<br>
      　そもそも、「君に恋してる」と「君を愛してる」のどちらが正しいのか。無粋ではあるが考えてみよう。
<br><br>　この問題に関しては、文法・語法的な観点と、ニュアンスの観点、二つの方向からアクセスできる。まずは「恋する」という動詞、そして関連語彙の由来や用法から考えてゆきたい。
    </p>
    <div class="ft-subtitle">二　名詞としての「恋」</div>
    <p class="ft-text">
      調べ始めてわかったが、これは随分と難しい問題のようだ。辞書ごとに様々な記述がなされているから、その内容を精査しながら進めねばならぬ。因みに今回使った岩波国語辞典・明鏡国語辞典・広辞苑の記述はそれぞれ【資料篇】としてまとめてあるから、ご参照いただきたい。
      <br>　それでは名詞としての「恋」について。
      <br><br>①「恋」は気持だけを表すのか、心の活動までをも表すのか
      <br>　岩波の「恋」の項の説明が興味深い。
      <br>
      <br>「▽本来は、（異性に限らず）その対象にどうしようもないほど引きつけられ、しかも、満たされず苦しくてつらい気持を言う。「―に焼けて死ぬ虫になったって、思いはとげて見せるぞ」のような用例から見て取れるとおり、心の活動（やその内容）を言う「思い」とは区別される。「―は楽し、野辺の花よ」のような言い方は、一九一〇年代ごろからのもの。」
      <br>
      <br>つまり、「恋」が「恋という動作」を表すに留まって、「恋心」までは表さないのだと言う。
      <br>　実は、これを読んでから他の辞書を眺めてみると僅かな表現の差異に気づく。広辞苑では、「愛」が「相手を慕う『情』」であると説明されているのに対し、「恋」の項では「切なく思うこと。また、そのこころ」と説明されており、「愛」はあくまで情なのだが、「恋」はそもそもが思うという行為で、転じてその心も表すようになった、という述べ方だ。
      <br><br>②「恋」に対象は存在するのか
      <br>　一からかなり分かってくるだろうか。「恋」がその動作自体を表す名詞ならば、「恋」に存在するのは対象というより「動作の原因」に近くなると思う。この話は四章で触れたい。
    </p>
    <div class="ft-subtitle">三　サ変動詞としての「恋」</div>
    <p class="ft-text">
      <br>①サ変動詞の成立
      <br>　まず、サ変動詞というものが何だったか振り返ろう。「サ変動詞」というのは、動詞「する」と同様の活用をする動詞のことだ。「せ（ず）／したい／する。／する（こと）／すれ（ば）／せよ。」などの形が主にある。そして、「する」の上に他の言葉がくっついてできる動詞も、同じくサ変動詞と呼ばれる。
      <br>「サ変動詞の構成<br>
      サ変動詞の多くは、漢語の名詞に「する」が付いた複合語である。 この他、外来語を語幹とするもの（例：「キャッチする」）、 和語の名詞＋「する」の形のもの（例：「早起きする」）、擬態語＋「する」の形のもの（例：「どきどきする」）が見られる。 「達する」「全うする」など、「する」の前の部分（語幹）が単独では単語として使われない形のものもある。」
      <br>（Wikipedia「サ行変格活用動詞」二〇一八年九月閲覧）
      <br>　さて、「恋する」もこのサ変動詞に含まれるわけだが、成り立ちから言うと、「恋」は訓読みをするので、右の引用部分では「和語の名詞＋する」に当たる。「愛する」が漢語由来の複合語なので、その点で「恋する」の方が若干俗っぽい（新しい？）表現かもしれない。現に、古語辞典に「恋す」が収容されていないことが多い（旺文社「全訳古語辞典　第三版」など）。
      <br>
      <br>②恋はするもの
      <br>　さて、「恋する」がくだけた言い方であるということを前提に考えれば、面白いことがわかってくる。
      <br>　まず単純に考えて、「恋をする」とは言っても、「愛をする」とは言わない。
      <br>　名詞「恋」が後ろに「する」を取れるのはなぜだろうか。恐らく「恋」は、例えば「読書」のように、『行為』を表す名詞なのだろうと考えられる。（少なくともそのようなニュアンスは含むに違いない）。つまり、「恋」というだけで「恋する」という『行動』がイメージされるのだ。
      <br>　一方の「愛」だが、これは「愛を告白する」のように用い、「愛」だけで「愛する」という動作は連想されない。あくまで「愛」とは感情、気持ちなのだ。
      <br>　先述の「恋する」がくだけた言い方である、という話と合わせて考えると、「恋する」は「恋をする」の略形として捉えられがちである、とも考えられる。
    </p>

    <div class="ft-subtitle">四　「に」と「を」</div>
    <p class="ft-text">
      <br>　ところで、「恋」の動詞形には「恋する」の他に「恋う」というものがある。この二つを比べてみよう。
      <br>　恋うというのは、広辞苑からも分かる通り本来「に」を受けて、「母に恋う」というふうに言った。それが平安以降「を」を受けるようになったという。これが何を意味するか。現在でも「恋する」が「に」を受け、「愛する」が「を」を受けることからすると、一つ言えるのは、平安期に「恋う」が「思う」の類の動詞に分類されたのではないか、ということだ。
      <br>　「思う」の類の動詞とは、特に専門用語などではない。ここでは「愛する」「慕う」「敬う」のように、その動詞だけで「愛おしく思う」「親しく思う」「尊く思う」と「思う」のニュアンスを含むものを指している。そしてそれらは思いの対象として「を」を受けるのだ。
      <br>　一方「恋する」の例では、その動詞だけでは「思う」のニュアンスを含まない。故に、対象を表す助詞「を」は取らずに、むしろ動作の原因「に」を取るのだ。
      <br>　しかし、「恋う」は違った。「故郷を恋う」と書けば、「故郷を恋しく思う」という風に訳せるのだ。これは「恋」のそもそもの用法から考えればおかしな話だが、「恋う」がサ変動詞、つまり《名詞＋する》という形を取らなかったがために、一つの動詞としての個性が強くなり、結果的に「恋」という名詞から（ニュアンスの面で）一定の距離を置くことになったのだろう。これが「恋う」が「思う」の類の動詞に分類された、ということである。
      <br>　「君に恋する」だけでは「君を恋しく思う」というニュアンスは含まれず、「君に恋という感情を抱いていますよ」程度のことなのだ。峻別が難しい話ではあるが、これは先述した「恋は気持ちのみを表し、思いは表さない」という話と繋がってくる。
      <br>　現代、「恋する」を「恋う」のように「を」を取って使う用法（「故郷を恋する」など）も辞書に掲載されていて、その場合はやはり「を」を取るのだが、実際にはどう使われているのだろうか。
      <br>「現代日本語書き言葉均衡コーパス『少納言』」を用いて検索した。これは書籍や新聞、国会会議録までの多数のデータを検索対象としているもので、ある文字列に対してどれほどの用例があるのか調べることができる。
      <br>　検索した結果、「恋する」が一九一件、「（を）恋する」が八〇件、「（に）恋する」が一〇四件となった（「を」「に」は前文脈指定。直前でなくても前の文脈に含まれていれば認識される）。ちなみに、前文脈指定をしない、直接の「を恋する」は八件。「に恋する」は一八件であった。
      <br>　検索結果からすると、僅差で「に」が優勢とは言え、「を」恋するというのも決して無視できない数であると分かった。
      <br>　つまり、現代語としては「君を恋する」という言い回しは決しておかしくないどころか、辞書にも収録され、人口に膾炙している表現だと言える。
    </p>

    <div class="ft-subtitle">五　「恋をする」</div>
    <p class="ft-text">
      <br>　但し、一つ注意すべきことがある。それは、「君を恋する」は、「君を恋をする」とは訳せない、ということだ。「恋う」のところで説明したように、「を」を取るということは一つの動詞としてまとまりが強くある必要があるのだ。
      <br>　「君に恋する」が「君に恋をする」と訳せることからも（第三章を参照されたい）、「に」を取るときは「恋＋する」という形が少なからず意識されていると言える。一方で「を」を取るときは「恋する」が一つの動詞として認識されているのだ。そして、特に「を」を取ったときに「恋しく思う」というニュアンスが生まれてくるのだ。
    </p>

    <div class="ft-subtitle">六　辞書的観点</div>
    <p class="ft-text">
      <br>　さて、これまで「恋してる」という言葉が二人称に用いうるか、という問題について辞書的な観点から切り込んできた。
      <br>　「君に恋する」と言ってしまえばどこか第三者的な言い方に聞こえるが、「君を恋する」との言い回しで「君を恋しく思っています」という意味を表せるようだから、二人称で「恋する」を使うことも正しいようだ。
      <br>　では、なぜ相手に「恋してる」という言葉を「愛してる」のように使えないのか、最後にニュアンスの面を考えていこう。    </p>
    <div class="ft-subtitle">七　ニュアンスの差</div>
    <p class="ft-text">
      <br>　「恋」という言葉のニュアンスを摑むべく、長らく動詞として用いられてきた「恋う」に注目してみよう。
      <br>　広辞苑の「恋う」の語釈からもわかる通り、「恋う」はそもそも「故郷を恋う」「亡き母を恋う」のように『今、手元にないものを求める』というようなニュアンスが存在する。「恋慕」なんて言葉もあったり恋の語釈に恋い慕うと書いてあったりするが、そもそも「慕う」の語釈を見ても『恋しく思い、また離れがたく思ってあとを追って行く』とあるではないか。
      <br>　つまり、「恋」は、『ないものを求める』、または「慕う」の通りに『なくならないように縋ってゆく』といったニュアンスが根底に流れているのだ。ここが本質である。
      <br>
      <br>　最初の問題提起が少し曖昧だったために混乱してしまうが、相手に面と向かって「君に恋してる」とは言わない。これは、七章で触れた通りに「恋」が「ないものを求める」というニュアンスを持っているからである。それは「恋う」「恋する」といった動詞でも同じことだ。眼前の人物に対して「恋してる」というのはニュアンスからして違和感を覚える。
      <br>　「二人称」で用いるという言葉を広い意味で解釈すれば、「恋する」は、①手紙文中、②独り言において使用可能だろう。
      <br>　①では暫く離れている相手などに「恋しく思います」との意味で「君を恋しています」というふうに使えるだろう。これは五章で触れた通りの「を」を取る「恋する」で、「思う」の意味まで含まれるから二人称として使えるのだ。
      <br>　②は少し特殊な例だ。「に」を取る方の「恋する」、つまり「恋という動作をしています」との意味で「君に恋してる」ということはできる。但し、先程も触れたように「恋」はないものを示しているのに加え、自分が恋という動作をしていることに気づく、といった内省的な言い回しのため、直接言うことは少ないということで、恐らく独り言などにおいてのみ使いうるものだろう。
      <br>
      <br>　まとめると、手紙文中や独り言において、二人称に「恋してる」という言葉を使うことはできる。しかし、面と向かって「恋してる」と言うのは「君を恋してる」でも「君に恋してる」の何れにしても変な文章になってしまうということだ。
    </p>
    <p class="ft-text">
      <br>　以上、「恋する」を色々な視点から見てきたが、どうだっただろうか。一つの言葉に対してこれだけ深く、様々な辞書を取っ替え引っ替え見比べて考えるのは面白いことである。そして、また辞書だけが言葉の意味を表すのではない、ということがおわかり頂けただろうか。
      <br>　皆さんも、日常生活の中でふと気になる言葉があったときに、まずは辞書を引いてみてほしい。きっと言葉の深い世界を知ることができるはずだ。
    </p>
    <div class="ft-subtitle">資料編</div>
    <p class="ft-text">
      こい【恋】コヒ　①一緒に生活できない人や亡くなった人に強くひかれて、切なく思うこと。また、そのこころ。特に、男女間の思慕の情。恋慕。恋愛。万葉集（20）「常陸さし行かむ雁もが吾（あ）が―を記して付けて妹に知らせむ」。「―に身を焼く」
      　②植物や土地などに寄せる思慕の情。万葉集（10）「桜花時は過ぎねど見る人の―の盛りと今し散るらむ」
      <br>　（広辞苑 第六版）
      <br>
      <br>こい　こひ　【恋】〘名・ス他〙異性に愛情を寄せること、その心。恋愛。「―は盲目」（恋をすると無分別になる）▽本来は、（異性に限らず）その対象にどうしようもないほど引きつけられ、しかも、満たされず苦しくてつらい気持を言う。「―に焼けて死ぬ虫になったって、思いはとげて見せるぞ」のような用例から見て取れるとおり、心の活動（やその内容）を言う「思い」とは区別される。「―は楽し、野辺の花よ」のような言い方は、一九一〇年代ごろからのもの。→こう（恋）
      <br>　（岩波国語辞典 第六版）
      <br>
      <br>こい【恋】コヒ〘名〙特定の異性（まれに同性）を強く慕うこと。切なくなるほど好きになること。また、その気持ち。「―に落ちる」「―に破れる」
      <br>　（明鏡国語辞典 第二版）
      <br>
      <br>あい【愛】①親兄弟のいつくしみ合う心。広く、人間や生物への思いやり。万葉集（５）「―は子に過ぎたりといふこと無し」②男女間の、相手を慕う情。恋。③かわいがること。大切にすること。御伽草子、七草草子「己より幼きをばいとほしみ、―をなし」④このむこと。めでること。醒睡笑「慈照院殿、―に思し召さるる壺あり」⑤愛敬（あいきょう）。愛想（あいそ）。好色二代男「まねけばうなづく、笑へば―をなし」⑥〔仏〕愛欲。愛着（あいじゃく）。渇愛。強い欲望。十二因縁では第８支に位置づけられ、迷いの根源として否定的にみられる。今昔物語集（２）「その形、端正なるを見て、忽ちに―の心をおこして妻（め）とせんと思ひて」⑦キリスト教で、神が、自らを犠牲にして、人間をあまねく限りなくいつくしむこと。
      <br>　（広辞苑 第六版）
      <br>
      <br>あい【愛】そのものの価値を認め、強く引きつけられる気持。 ○アかわいがり、いつくしむ心。「子にそそぐ―」。いつくしみ恵むこと。「神の―」。いたわりの心。「人類―」 ○イ大事なものとして慕う心。「母への―」。特に、男女間の慕い寄る心。恋。 ○ウその価値を認め、大事に思う心。「心理への―」
      <br>　（岩波国語辞典 第六版）
      <br>
      <br>あい【愛】□一〘名〙①価値あるものを大切にしたいと思う、人間本来の温かい心。「親の―を一身に集める」「自然への―」「人類―・郷土―・師弟―」②人、特に異性を慕う心。「―を告白する」③神仏の慈しみ・恵み。特に、キリスト教で、神が人類に示す無限の慈しみ。アガペー。④仏教で、ものに執着する心。愛執。愛着。□二（造）［略］
      <br>　（明鏡国語辞典 第二版）
      <br>
      <br>こい・する【恋する】コヒスル〘他サ変〙□文こひ・す（サ変）
      <br>恋をする。恋慕の情を寄せる。慕う。万葉集（11）「―・するに死（しに）するものあらませばわが身千遍（ちたび）死にかへらまし。」「―・する乙女」
      <br>　（広辞苑 第六版）
      <br>
      <br>こい-する　こひ‥【恋する】〘サ変他〙男女間で愛情を寄せる。異性を愛する。
      <br>　（岩波国語辞典 第六版）
      <br>
      <br>こい・する【恋する】コヒ―〘自他サ変〙①異性（まれに同性）に恋愛感情をいだく。恋をする。「隣の子に／を―」「―二人［季節］」②こがれるほどに憧れる。「恋に／を―年頃」「加藤は山に―・していた〈新田次郎〉」
      <br>（明鏡国語辞典 第六版）
      <br>
      （終）    </p>


    <div class="ft-subtitle">展示内容</div>
    <p class="ft-text">
      <strong>1.模型の体験運転</strong><br>
      鉄研の車窓からでは、部員が作成したジオラマを用いた、鉄道模型の体験運転を行っています。このジオラマ、7畳分もの大きさを持っていて、普段めったに出会うことの出来ないスケールの中での模型の運転体験をすることができます。また、車両は一定時間ごとに入れ替わるので、様々な車両を運転できる可能性があります。車両は30分おきに変わるので、少し待ってみるとお目当ての車両が走るかも・・・？
      <br><br><strong>2.前面展望の上映</strong><br>
      展示室入口付近で、前面展望（先頭車両から撮影した映像）を上映しています。映像は全て部員が撮影・編集していて、ローカル線から通勤路線まで実にたくさんあります。
      <br><br><strong>3.発車ベル体験</strong><br>
      駅などで乗務員の方が「発車ベルボタン」を押しているのを見たことがある人もいるのではないでしょうか？本企画では、そのボタンを用いた発車ベル体験を行っています。発車メロディの音源はほとんどが部員の手による録音で、押すたびにメロディが切り替わります。家の近くの駅のメロディなどを探してみるのも面白いかもしれませんね。
      <br><br><strong>4.鉄道シミュレータ</strong><br>
      部員が作成した路線データで、車両を走行させることができます。沿線も作り込まれていて、実際に運転しているような気分に浸れます。
      <br><br><strong>5.方向幕・記念品</strong><br>
      出口付近で展示しています。方向幕は東急電鉄とJR常磐線で実際に使用されていたもので、回すことができます。
    </p>

    <div class="ft-subtitle">

    </div>
  </div>
</template>

<script>
    import Header from '~/components/Myheader.vue'
    import Article from '~/components/FeatureArticle.vue'

    export default {
        name: "feature",
        components: {
            Article,
          Header
        },
        data() {
            return {
                message: "Hello"
            }
        }
    }
</script>

<style scoped>
  a:link {
    text-decoration: none;
  }

  .container-feature {
    padding: 0px 15px 30px;
    background-color: #411445;
    color: white;
  }
  .head-thumbnail >img{
    width: 100%;
    object-fit: cover;
  }

  .ft-title {
    font-size: 24px;
    font-weight: bold;
    line-height: 1.2;
    padding: 140px 0px 60px;
  }
  .ft-subtitle{
    font-size: 20px;
    font-weight: bold;
    margin-top: 30px;
  }

  .ft-text{
    padding: 30px 5px;
    line-height: 1.7;
    letter-spacing: 0.05em;
    justify-content: center;
    text-indent: 1;
    initial-letter: 30;

  }
  .ft-text >img {
    width: 80%;
    margin: 10px auto;
    display: flex;

  }
  .ft-thumb{
    font-size: 13px;
    text-align: center;
    margin: 20px auto;
  }

</style>